modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
        <register>
          <name>NSCCR</name>
          <description>FLASH non-secure clear control register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLR_EOP</name>
              <description>EOP flag clear bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_WRPERR</name>
              <description>WRPERR flag clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_PGSERR</name>
              <description>PGSERR flag clear bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_STRBERR</name>
              <description>STRBERR flag clear bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_INCERR</name>
              <description>INCERR flag clear bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OBKERR</name>
              <description>OBKERR flag clear bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OBKWERR</name>
              <description>OBKWERR flag clear bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>Option byte change error clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCCR</name>
          <description>FLASH secure clear control register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLR_EOP</name>
              <description>EOP flag clear bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_WRPERR</name>
              <description>WRPERR flag clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_PGSERR</name>
              <description>PGSERR flag clear bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_STRBERR</name>
              <description>STRBERR flag clear bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_INCERR</name>
              <description>INCERR flag clear bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OBKERR</name>
              <description>OBKERR flag clear bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OBKWERR</name>
              <description>OBKWERR flag clear bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>Option byte change error clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR</name>
          <description>FLASH privilege configuration register</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPRIV</name>
              <description>Privilege protection for secure registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSPRIV</name>
              <description>Privilege protection for non-secure registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSOBKCFGR</name>
          <description>FLASH non-secure option byte key configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>OBKCFGR lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_SECT_REQ</name>
              <description>OBK swap sector request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALT_SECT</name>
              <description>Alternate sector</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALT_SECT_ERASE</name>
              <description>Alternate sector erase</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_OFFSET</name>
              <description>Swap offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECOBKCFGR</name>
          <description>FLASH secure option byte key configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>OBKCFGR lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_SECT_REQ</name>
              <description>OBK swap sector request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALT_SECT</name>
              <description>Alternate sector</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALT_SECT_ERASE</name>
              <description>Alternate sector erase</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_OFFSET</name>
              <description>Swap offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPEXTR</name>
          <description>FLASH HDP extension register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDP1_EXT</name>
              <description>HDP area extension in 8kB sectors in bank 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>HDP2_EXT</name>
              <description>HDP area extension in 8kB sectors in bank 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR_CUR</name>
          <description>FLASH option status current register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BORH_EN</name>
              <description>Brownout high enable configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>WWDG control mode option bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>Stop mode entry reset option bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STDBY</name>
              <description>Standby mode entry reset option bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRODUCT_STATE</name>
              <description>Life state code option byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IO_VDD_HSLV</name>
              <description>VDD I/O high-speed at low-voltage option bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_VDDIO2_HSLV</name>
              <description>VDDIO2 I/O high-speed at low-voltage option bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>Independent watchdog counter freeze in Stop mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_STDBY</name>
              <description>Independent watchdog counter freeze in Standby mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_UBE</name>
              <description>Unique boot entry option byte</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SWAP_BANK</name>
              <description>Bank swapping option bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR_PRG</name>
          <description>FLASH option status to program register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BORH_EN</name>
              <description>Brownout high enable configuration bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG control mode option bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>WWDG control mode option bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>Stop mode entry reset option bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STDBY</name>
              <description>Standby mode entry reset option bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRODUCT_STATE</name>
              <description>Life state code option byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IO_VDD_HSLV</name>
              <description>VDD I/O high-speed at low-voltage option bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_VDDIO2_HSLV</name>
              <description>VDDIO2 I/O high-speed at low-voltage option bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>Independent watchdog counter freeze in Stop mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_STDBY</name>
              <description>Independent watchdog counter freeze in Standby mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT_UBE</name>
              <description>Unique boot entry option byte</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SWAP_BANK</name>
              <description>Bank swapping option bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSEPOCHR_CUR</name>
          <description>FLASH non-secure epoch current register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NSEPOCHR_PRG</name>
          <description>FLASH non-secure epoch to program register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECEPOCHR_CUR</name>
          <description>FLASH secure epoch current register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECEPOCHR_PRG</name>
          <description>FLASH secure epoch to program register</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>OPTSR2_CUR</name>
          <description>FLASH option status current register 2</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM1_3_RST</name>
              <description>SRAM1 and SRAM3 erased when a system reset occurs</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_RST</name>
              <description>SRAM2 erased when a system reset occurs</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPRAM_ECC</name>
              <description>Backup RAM ECC detection and correction enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3_ECC</name>
              <description>SRAM3 ECC detection and correction enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_ECC</name>
              <description>SRAM2 ECC detection and correction disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPD_DIS</name>
              <description>USB power delivery configuration disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZEN</name>
              <description>TrustZone enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTSR2_PRG</name>
          <description>FLASH option status to program register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM1_3_RST</name>
              <description>SRAM1 and SRAM3 erased when a system reset occurs</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_RST</name>
              <description>SRAM2 erased when a system reset occurs</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPRAM_ECC</name>
              <description>Backup RAM ECC detection and correction enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3_ECC</name>
              <description>SRAM3 ECC detection and correction enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_ECC</name>
              <description>SRAM2 ECC detection and correction disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPD_DIS</name>
              <description>USB power delivery configuration disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZEN</name>
              <description>TrustZone enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSBOOTR_CUR</name>
          <description>FLASH non-secure unique boot entry current register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>NSBOOTR_PRG</name>
          <description>FLASH non-secure unique boot entry to program register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BOOTADD</name>
              <description>Boot address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBOOTR_CUR</name>
          <description>FLASH secure unique boot entry current register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECBOOTR_PRG</name>
          <description>FLASH secure unique boot entry to program register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BOOTADD</name>
              <description>Boot address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBLR_CUR</name>
          <description>FLASH OTP block lock current register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>OTPBLR_PRG</name>
          <description>FLASH OTP block Lock to program register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECBB1R1</name>
          <description>FLASH secure block-based bank 1 register 1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECBB1R2</name>
          <description>FLASH secure block-based bank 1 register 2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVBB1R1</name>
          <description>FLASH privilege block-based bank 1 register 1</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVBB1R2</name>
          <description>FLASH privilege block-based bank 1 register 2</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECWM1R_CUR</name>
          <description>FLASH secure watermark 1 current register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECWM1R_PRG</name>
          <description>FLASH secure watermark 1 to program register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>WRP1R_CUR</name>
          <description>FLASH write sector group protection current register for bank1</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>WRP1R_PRG</name>
          <description>FLASH write sector group protection to program register for bank1</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>EDATA1R_CUR</name>
          <description>FLASH data sectors configuration current register for bank1</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
        </register>
