modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
        <register>
          <name>EDATA1R_PRG</name>
          <description>FLASH data sectors configuration to program register for bank1</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HDP1R_CUR</name>
          <description>FLASH HDP configuration current register for bank1</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HDP1R_PRG</name>
          <description>FLASH HDP configuration to program register for bank1</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ECCCORR</name>
          <description>FLASH ECC correction register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>ECCDETR</name>
          <description>FLASH ECC detection register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDR_ECC</name>
              <description>ECC fail address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>OBK_ECC</name>
              <description>Flash OB Keys storage area ECC fail</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATA_ECC</name>
              <description>Flash high-cycle data ECC fail</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK_ECC</name>
              <description>ECC fail bank</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSF_ECC</name>
              <description>System Flash ECC fail</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTP_ECC</name>
              <description>Flash OTP ECC fail</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCIE</name>
              <description>ECC correction interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCC</name>
              <description>ECC correction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCD</name>
              <description>ECC detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCDR</name>
          <description>FLASH ECC data register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FAIL_DATA</name>
              <description>ECC fail data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBB2R1</name>
          <description>FLASH secure block-based bank 2 register 1</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECBB2R2</name>
          <description>FLASH secure block-based bank 2 register 2</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVBB2R1</name>
          <description>FLASH privilege block-based bank 2 register 1</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>PRIVBB2R2</name>
          <description>FLASH privilege block-based bank 2 register 2</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECWM2R_CUR</name>
          <description>FLASH secure watermark 2 current register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SECWM2R_PRG</name>
          <description>FLASH secure watermark 2 to program register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>WRP2R_CUR</name>
          <description>FLASH write sector group protection current register for bank2</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>WRP2R_PRG</name>
          <description>FLASH write sector group protection to program register for bank2</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>EDATA2R_CUR</name>
          <description>FLASH data sectors configuration current register for bank2</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>EDATA2R_PRG</name>
          <description>FLASH data sectors configuration to program register for bank2</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HDP2R_CUR</name>
          <description>FLASH HDP configuration current register for bank2</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HDP2R_PRG</name>
          <description>FLASH HDP configuration to program register for bank2</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
        </register>
