modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HASH</name>
      <description>HASH</description>
      <baseAddress>0x420c0400</baseAddress>
      <interrupt>
        <name>HASH</name>
        <description>HASH global interrupt</description>
        <value>117</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>HASH control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INIT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATATYPE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBW</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DINNE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDMAT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKEY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALGO</name>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN</name>
          <description>HASH data input register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STR</name>
          <description>HASH start register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NBLW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DCAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HRA0</name>
          <description>HASH digest registers</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HRA1</name>
          <description>HASH digest registers</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HRA2</name>
          <description>HASH digest registers</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HRA3</name>
          <description>HASH digest registers</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HRA4</name>
          <description>HASH digest registers</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IMR</name>
          <description>HASH interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DINIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>HASH status register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DINIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBWP</name>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DINNE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBWE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>103</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CSR[%s]</name>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR0</name>
          <description>HASH digest registers</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR1</name>
          <description>HASH digest registers</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR2</name>
          <description>HASH digest registers</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR3</name>
          <description>HASH digest registers</description>
          <addressOffset>0x31c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR4</name>
          <description>HASH digest registers</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR5</name>
          <description>HASH digest registers</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR6</name>
          <description>HASH digest registers</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR7</name>
          <description>HASH digest registers</description>
          <addressOffset>0x32c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR8</name>
          <description>HASH digest registers</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR9</name>
          <description>HASH digest registers</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR10</name>
          <description>HASH digest registers</description>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR11</name>
          <description>HASH digest registers</description>
          <addressOffset>0x33c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR12</name>
          <description>HASH digest registers</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR13</name>
          <description>HASH digest registers</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR14</name>
          <description>HASH digest registers</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR15</name>
          <description>HASH digest registers</description>
          <addressOffset>0x34c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR16</name>
          <description>HASH digest registers</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR17</name>
          <description>HASH digest registers</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR18</name>
          <description>HASH digest registers</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR19</name>
          <description>HASH digest registers</description>
          <addressOffset>0x35c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR20</name>
          <description>HASH digest registers</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR21</name>
          <description>HASH digest registers</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR22</name>
          <description>HASH digest registers</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR23</name>
          <description>HASH digest registers</description>
          <addressOffset>0x36c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR24</name>
          <description>HASH digest registers</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR25</name>
          <description>HASH digest registers</description>
          <addressOffset>0x374</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR26</name>
          <description>HASH digest registers</description>
          <addressOffset>0x378</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR27</name>
          <description>HASH digest registers</description>
          <addressOffset>0x37c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR28</name>
          <description>HASH digest registers</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR29</name>
          <description>HASH digest registers</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR30</name>
          <description>HASH digest registers</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR31</name>
          <description>HASH digest registers</description>
          <addressOffset>0x38c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR32</name>
          <description>HASH digest registers</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR33</name>
          <description>HASH digest registers</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR34</name>
          <description>HASH digest registers</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR35</name>
          <description>HASH digest registers</description>
          <addressOffset>0x39c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR36</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR37</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR38</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR39</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR40</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR41</name>
          <description>HASH digest registers</description>
          <addressOffset>0x3b4</addressOffset>
          <size>0x20</size>
        </register>
