modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PLAY1</name>
      <description>Programmable Logic Array (PLAY)</description>
      <baseAddress>0x44008000</baseAddress>
      <interrupt>
        <name>PLAY1</name>
        <description>PLAY1 global non-secure interrupt</description>
        <value>147</value>
      </interrupt>
      <registers>
        <register>
          <name>CFGCR</name>
          <description>PLAY Configuration Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>UNLOCK</name>
              <description>Unlock configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR</name>
          <description>PLAY Security attributes Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEC</name>
              <description>Security configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC_ITEM_CONFIG</name>
                  <description>PLAY configuration registers items</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC_ITEM_ALL</name>
                  <description>All PLAY registers items</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATTR_NSEC</name>
                  <description>Non-secure attribute</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR</name>
          <description>PLAY Privilege attributes Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIV</name>
              <description>Privilege configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIV_ITEM_CONFIG</name>
                  <description>PLAY configuration registers items</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIV_ITEM_ALL</name>
                  <description>All PLAY registers items</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATTR_NPRIV</name>
                  <description>Non-privileged attribute</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT0CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT1CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT2CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT3CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FILT4CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
