modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
        <register>
          <name>LE11CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE12CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE13CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE14CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE15CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE0CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE1CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE2CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
