modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
        <register>
          <name>CFGR1</name>
          <description>RCC clock configuration register 1</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SW</name>
              <description>SW[1:0] bits (System clock Switch)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI oscillator selection as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI oscillator selection as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE oscillator selection as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 selection as system clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS[1:0] bits (System Clock Switch Status)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI oscillator used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI oscillator used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE oscillator used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 used as system clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPWUCK</name>
              <description>Wake Up from stop and HSE CSS backup clock selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI selection as system clock after wake-up from STOP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI selection as system clock after wake-up from STOP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPKERWUCK</name>
              <description>Kernel Clock Selection after a Wake Up from STOP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI selection as kernel clock after wake-up from STOP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI selection as kernel clock after wake-up from STOP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <description>HSE division factor for RTC Clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLOCK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_33</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_34</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_35</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_36</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_37</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_38</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_39</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_40</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_41</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_42</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_43</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_44</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_45</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_46</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_47</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_48</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_49</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_50</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_51</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_52</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_53</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_54</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_55</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_56</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_57</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_58</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_59</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_60</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_61</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_62</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_63</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPRE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCO1PRE</name>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1SEL</name>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2SEL</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>RCC clock configuration register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HPRE</name>
              <description>HPRE[3:0] bits (AHB prescaler)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>SYSCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>SYSCLK divided by 2</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>SYSCLK divided by 4</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>SYSCLK divided by 8</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>SYSCLK divided by 16</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_64</name>
                  <description>SYSCLK divided by 64</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_128</name>
                  <description>SYSCLK divided by 128</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_256</name>
                  <description>SYSCLK divided by 256</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_512</name>
                  <description>SYSCLK divided by 512</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE1</name>
              <description>PPRE1[2:0] bits (APB1 prescaler)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>HCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>HCLK divided by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>HCLK divided by 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>HCLK divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>HCLK divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE2</name>
              <description>PPRE2[2:0] bits (APB2 prescaler)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>HCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>HCLK divided by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>HCLK divided by 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>HCLK divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>HCLK divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPRE3</name>
              <description>PPRE3[2:0] bits (APB3 prescaler)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>HCLK not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>HCLK divided by 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>HCLK divided by 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>HCLK divided by 8</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>HCLK divided by 16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB1DIS</name>
              <description>AHB1 clock disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2DIS</name>
              <description>AHB2 clock disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4DIS</name>
              <description>AHB4 clock disable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1DIS</name>
              <description>APB1 clock disable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2DIS</name>
              <description>APB2 clock disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3DIS</name>
              <description>APB3 clock disable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
