modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
    <peripheral derivedFrom="IWDG">
      <name>IWDG_S</name>
      <description>IWDG</description>
      <baseAddress>0x50003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI2_S</name>
      <description>SPI</description>
      <baseAddress>0x50003800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <baseAddress>0x50003c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP12">
      <name>COMP12_S</name>
      <description>Comparator</description>
      <baseAddress>0x50004000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP1_S</name>
      <baseAddress>0x5000400c</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2_S</name>
      <baseAddress>0x50004010</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART2_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART3_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART4_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C1_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C1_S</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <baseAddress>0x50005c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CRS">
      <name>CRS_S</name>
      <description>Clock Recovery System</description>
      <baseAddress>0x50006000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART6_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50006400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CEC">
      <name>CEC_S</name>
      <description>Consumer Electronics Control</description>
      <baseAddress>0x50007000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART7_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART8_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DTS">
      <name>DTS_S</name>
      <description>DTS</description>
      <baseAddress>0x50008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN1">
      <name>FDCAN2_S</name>
      <description>FD Controller Area Network</description>
      <baseAddress>0x5000a800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UCPD1">
      <name>UCPD1_S</name>
      <description>UCPD</description>
      <baseAddress>0x5000dc00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM1">
      <name>TIM1_S</name>
      <description>TIM</description>
      <baseAddress>0x50012c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI1_S</name>
      <description>SPI</description>
      <baseAddress>0x50013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM8">
      <name>TIM8_S</name>
      <description>TIM</description>
      <baseAddress>0x50013400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x50013800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM15">
      <name>TIM15_S</name>
      <description>TIM</description>
      <baseAddress>0x50014000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI4_S</name>
      <description>SPI</description>
      <baseAddress>0x50014c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB_DRD_FS">
      <name>USB_DRD_FS_S</name>
      <description>Universal Serial Bus Full Speed Dual Role Device</description>
      <baseAddress>0x50016000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USB_DRD_PMA_BUFF">
      <name>USB_DRD_PMA_BUFF_S</name>
      <description>Universal Serial Bus PacketMemoryArea Buffer Descriptor Table</description>
      <baseAddress>0x50016400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA1_S</name>
      <description>DMA Controller</description>
      <baseAddress>0x50020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA2_S</name>
      <description>DMA Controller</description>
      <baseAddress>0x50021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FLASH">
      <name>FLASH_S</name>
      <description>FLASH Registers</description>
      <baseAddress>0x50022000</baseAddress>
      <interrupt>
        <name>FLASH_S</name>
        <description>FLASH secure global interrupt</description>
        <value>7</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CRC">
      <name>CRC_S</name>
      <description>CRC calculation unit</description>
      <baseAddress>0x50023000</baseAddress>
    </peripheral>
