modm-ext/data.modm.io/docs/svd/header_stm32h543xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RAMCFG_BKPRAM">
      <name>RAMCFG_BKPRAM_S</name>
      <description>SRAMs configuration controller</description>
      <baseAddress>0x50026100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ETH">
      <name>ETH_S</name>
      <description>Ethernet MAC</description>
      <baseAddress>0x50028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ICACHE">
      <name>ICACHE_S</name>
      <description>Instruction Cache</description>
      <baseAddress>0x50030400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCACHE1">
      <name>DCACHE1_S</name>
      <description>Data Cache</description>
      <baseAddress>0x50031400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZSC1">
      <name>GTZC_TZSC1_S</name>
      <description>Global TrustZone Controller</description>
      <baseAddress>0x50032400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZIC1">
      <name>GTZC_TZIC1_S</name>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB1_S</name>
      <baseAddress>0x50032c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB2_S</name>
      <baseAddress>0x50033000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB3_S</name>
      <baseAddress>0x50033400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOA_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH_S</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x52021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC1_S</name>
      <description>ADC</description>
      <baseAddress>0x52028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2_S</name>
      <description>ADC</description>
      <baseAddress>0x52028100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC12_COMMON">
      <name>ADC12_COMMON_S</name>
      <baseAddress>0x52028300</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC1">
      <name>DAC1_S</name>
      <description>DAC</description>
      <baseAddress>0x52028400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCMI">
      <name>DCMI_S</name>
      <description>DCMI</description>
      <baseAddress>0x5202c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>PSSI_S</name>
      <description>PSSI</description>
      <baseAddress>0x5202c400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC3">
      <name>ADC3_S</name>
      <description>ADC</description>
      <baseAddress>0x5202d800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="HASH">
      <name>HASH_S</name>
      <description>HASH</description>
      <baseAddress>0x520c0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>RNG_S</name>
      <description>RNG</description>
      <baseAddress>0x520c0800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>PKA_S</name>
      <description>PKA</description>
      <baseAddress>0x520c2000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SBS">
      <name>SBS_S</name>
      <description>System configuration, Boot and Security</description>
      <baseAddress>0x54000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <baseAddress>0x54002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x54002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C2_S</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <baseAddress>0x54003000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <baseAddress>0x54004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="VREFBUF">
      <name>VREFBUF_S</name>
      <description>VREFBUF</description>
      <baseAddress>0x54007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RTC">
      <name>RTC_S</name>
      <description>Real-Time Clock</description>
      <baseAddress>0x54007800</baseAddress>
      <interrupt>
        <name>RTC_S</name>
        <description>RTC secure interrupt</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TAMP">
      <name>TAMP_S</name>
      <description>Tamper and backup registers</description>
      <baseAddress>0x54007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PLAY1">
      <name>PLAY1_S</name>
      <description>Programmable Logic Array (PLAY)</description>
      <baseAddress>0x54008000</baseAddress>
      <interrupt>
        <name>PLAY1_S</name>
        <description>PLAY1 global secure interrupt</description>
        <value>148</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PWR">
      <name>PWR_S</name>
      <description>Power Control</description>
      <baseAddress>0x54020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RCC">
      <name>RCC_S</name>
      <description>Reset and Clock Control</description>
      <baseAddress>0x54020c00</baseAddress>
      <interrupt>
        <name>RCC_S</name>
        <description>RCC secure global interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EXTI">
      <name>EXTI_S</name>
      <description>Asynch Interrupt/Event Controller (EXTI)</description>
      <baseAddress>0x54022000</baseAddress>
    </peripheral>
